Show / Hide Table of Contents
Class Tendon
Tendon base class
Inheritance
System.Object
OpenObject
OpenElementId
Tendon
BondedTendon
PretensionedTendonGroup
PretensionedTendonGroupItem
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class Tendon : OpenElementId
Properties
Improve this Doc   View Source
Material
Material
Declaration
public ReferenceElement Material { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
NumberOfStrand
Number of strands
Declaration
public int NumberOfStrand { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source